{
    "Type": "Bill",
    "Tag": "AMN",
    "Id": 6,
    "Name": "Fix Our Stupid Mistakes",
    "Short Name": "FOSM",
    "Revision": null,
    "Vote ended time": null,
    "Voted Time": null,
    "Time Proposed": 1624330019,
    "Proposer": {
      "svid": "u-c60c6bd8-0409-4cbd-8bb8-3c87e24c55f8",
      "name": "superjacobl"
    },
    "Authors": [
      {
        "svid": "u-c60c6bd8-0409-4cbd-8bb8-3c87e24c55f8",
        "name": "superjacobl"
      }
    ],
    "Content": "Summary of this Amendment\nThis amendment fixes many parts of our constitution\n\n\n\n\n\n\n\n1. This amendment overrides anything that conflicts with the constitution.\n2. Congress may, with ¾ vote in both chambers, start the impeachment of any federal officer, including the President and Vice President, for Treason, Bribery, or other high Crimes and Misdemeanors, but the Emperor shall be unimpeachable. The Supreme Court shall hold a trial if the Congress starts an impeachment, in which the Supreme Court shall either vote to uphold the impeachment or to void the impeachment.\n3. The President shall nominate, and with a ⅔ majority vote in both chambers of Congress, shall appoint Ambassadors, other public Ministers and Consuls, Judges of the Supreme Court, and all other Officers of Vooperia, but the Congress may by Law and by ⅔ majority vote in both chambers of Congress, vest the Appointment of such inferior Officers, as they think proper, in the President alone, in the Courts of Law, or in the Heads of Departments/Ministries.\n4. The President shall once a month give to the Congress Information on the State of the Empire, and recommend to their Consideration such Measures as the President shall judge necessary and expedient; the President shall take Care that the Laws be faithfully executed.\n5. Congress may by law restrict the President's power to remove Ambassadors, other public Ministers and Consuls, and all other Officers of Vooperia.\n6. Congress may by law restrict the President's power to control Departments and Ministries.\n7. Congress, and districts shall make no law prohibiting political parties, but Congress may with ⅔ majority vote in both chambers, regulate political parties.\n8. Senators must live in the district that they represent.\n9. Senators and House of Delegates Members may not hold office for 90 days if they get impeached.\n10. Major Government Roles\n   1. A citizen may only hold a single major government role. \n   2. A major government role is considered to be a seat on the Senate or House of Delegates, a seat on a Supreme Court, a seat on an inferior Court, the President position, or the Vice President position.\n   3. Those holding more than one major government role must resign from all but one major government role.\n   4. Whenever there's a vacancy in a senatorship position, the executive authority of the senatorship’s district shall make a temporary appointment until the next senate election.\n11. In order for a bill to pass both chambers of Congress, the contents of the bill must be exactly the same in both chambers.\n12. The citizens of a district may with a ⅔ majority vote, recall their senator.\n13. No district shall make, enforce any law, constitution, or constitutional amendment which violates the rights protected under this constitution.\n14. If a district lacks a constitution, then their senator shall hold no voting power in the senate.\n   1. This is not in effect for the first 3 weeks of this amendment being adopted.",
    "Votes": null
  }